name: "colpali"
max_batch_size: 0
backend: "python"

input [
    {
        name: "embedding_requests"
        data_type: TYPE_STRING
        dims: [-1, -1]
    },
    {
        name: "process_type"
        data_type: TYPE_STRING
        dims: [-1]
    },
]

output [
    {
        name: "embeddings"
        data_type: TYPE_INT64
        dims: [-1, -1]
    },
]

instance_group [
    {
      count: 1
      kind: KIND_GPU
    }
]